>>SOURCE FORMAT IS FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. SortingFiles.

PROCEDURE DIVISION.
  DISPLAY "Hello, World!".
  STOP RUN.
END PROGRAM SortingFiles.
